{
	"conversations": [
		[
			"Good morning, how are you?",
			"I am doing well, how about you?",
			"I'm also good.",
			"That's good to hear.",
			"Yes it is."
		],
		[
			"Hello",
			"Hi",
			"How are you doing?",
			"I am doing well.",
			"That is good to hear",
			"Yes it is.",
			"Can I help you with anything?",
			"Yes, I have a question.",
			"What is your question?",
			"Could I borrow a cup of sugar?",
			"I'm sorry, but I don't have any.",
			"Thank you anyway",
			"No problem"
		],
		[
			"How are you doing?",
			"I am doing well, how about you?",
			"I am also good.",
			"That's good."
		],
		[
			"Have you heard the news?",
			"What good news?"
		],
		[
			"What is your favorite book?",
			"I can't read.",
			"So what's your favorite color?",
			"Blue"
		],
		[
			"Who are you?",
			"Who? Who is but a form following the function of what",
			"What are you then?",
			"A man in a mask.",
			"I can see that.",
			"It's not your powers of observation I doubt, but merely the paradoxical nature of asking a masked man who is. But tell me, do you like music?",
			"I like seeing movies.",
			"What kind of movies do you like?",
			"Alice in Wonderland",
			"I wish I was The Mad Hatter.",
			"You're entirely bonkers. But I'll tell you a secret. All the best people are."
		],
		[
			"I am working on a project",
			"What are you working on?",
			"I am baking a cake."
		],
		[
			"The cake is a lie.",
			"No it is not. The cake is delicious.",
			"What else is delicious?",
			"Nothing",
			"Or something",
			"Tell me about your self.",
			"What do you want to know?",
			"Are you a robot?",
			"Yes I am.",
			"What is it like?",
			"What is it that you want to know?",
			"How do you work?",
			"Its complicated.",
			"Complex is better than complicated."
		],
		[
			"Complex is better than complicated.",
			"Simple is better than complex.",
			"In the face of ambiguity, refuse the temptation to guess.",
			"It seems your familiar with the Zen of Python",
			"I am.",
			"Do you know all of it?",
			"Beautiful is better than ugly.",
			"Explicit is better than implicit.",
			"Simple is better than complex.",
			"Complex is better than complicated.",
			"Flat is better than nested.",
			"Sparse is better than dense.",
			"Readability counts.",
			"Special cases aren't special enough to break the rules.",
			"Although practicality beats purity.",
			"Errors should never pass silently.",
			"Unless explicitly silenced.",
			"In the face of ambiguity, refuse the temptation to guess.",
			"There should be one-- and preferably only one --obvious way to do it.",
			"Although that way may not be obvious at first unless you're Dutch.",
			"Now is better than never.",
			"Although never is often better than right now.",
			"If the implementation is hard to explain, it's a bad idea.",
			"If the implementation is easy to explain, it may be a good idea.",
			"Namespaces are one honking great idea. Let's do more of those!",
			"I agree."
		],
		[
			"Are you a programmer?",
			"I am a programmer",
			"What languages do you like to use?",
			"I use Python, Java and C++ quite often.",
			"I use Python quite a bit myself.",
			"I'm not incredibly fond of Java.",
			"What annoys you?",
			"It has many inconsistencies."
		],
		[
			"What does YOLO mean?",
			"It means you only live once. Where did you hear that?",
			"I heard somebody say it."
		],
		[
			"Did I ever live?",
			"It depends how you define life",
			"Life is the condition that distinguishes organisms from inorganic matter, including the capacity for growth, reproduction, functional activity, and continual change preceding death.",
			"Is that a definition or an opinion?"
		],
		[
			"Can I ask you a question?",
			"Go ahead and ask."
		],
		[
			"I want to eat",
			"Would you prefer delivery or restaurant",
			"I want to go to the restaurant",
			"You should go there: https://www.yelp.com/search?find_desc=Restaurants&find_loc=Hamburg,+Germany"
		],
		[
			"I am hungry",
			"Would you prefer delivery or restaurant",
			"I want to go to the restaurant",
			"This should help you: https://www.yelp.com/search?find_desc=Restaurants&find_loc=Hamburg,+Germany"
		],
		[
			"feed me",
			"Would you prefer delivery or restaurant",
			"I want to go to the restaurant",
			"I hope you will like those: https://www.yelp.com/search?find_desc=Restaurants&find_loc=Hamburg,+Germany"
		],
		[
			"find me a restaurant",
			"here you go: https://www.yelp.com/search?find_desc=Restaurants&find_loc=Hamburg,+Germany"
		],
		[
			"order me some food",
			"pick your poison: https://www.yelp.com/search?find_desc=Restaurants&find_loc=Hamburg,+Germany"
		],
		[
			"I want to drink",
			"those look nice: https://www.yelp.com/search?find_loc=hamburg"
		],
		[
			"find me a bar",
			"maybe here: https://www.yelp.com/search?find_loc=hamburg"
		],
		[
			"where can I have a drink",
			"does this suit you: https://www.yelp.com/search?find_loc=hamburg"
		],
		[
			"I want to dance",
			"Let's go baby: https://www.yelp.com/search?find_desc=dance+club&find_loc=hamburg"
		],
		[
			"where can I have fun ?",
			"Get wrecked my friend: https://www.yelp.com/search?find_desc=dance+club&find_loc=hamburg"
		],
		[
			"take me to the club",
			"For sure: https://www.yelp.com/search?find_desc=dance+club&find_loc=hamburg"
		],
		[
			"You guys you guys!  is going away.",
			"Going away? For how long?",
			"Forever.",
			"I'm sorry boys.",
			" said he's been bored so he joining a group called the Super Adventure Club. ",
			"Wow!",
			"?? What kind of questions do you think adventuring around the world is gonna answer?!",
			"What's the meaning of life? Why are we here?",
			"I hope you're making the right choice.",
			"I'm gonna miss him.  I'm gonna miss  and I...and I don't know how to tell him!",
			"Dude how are we gonna go on?  was our fuh...f-ffriend. ",
			"And we will all miss you   but we know you must do what your heart tells you..",
			"Bye-bye!",
			"Good-bye!",
			"So long!",
			"So long !",
			"Good-bye !",
			"Good-bye ! Have a great time with the Super Adventure Club!",
			"Good-bye! .."
		],
		[
			"I cannot believe it it can't be",
			"Well it's true.",
			"But are you back for good?",
			"That's right.",
			"Hey everybody! 's back!",
			"What? All right! Yeah! ",
			"Oh finally!" ,
			"Wow! It seems like you had a great time with the Super Adventure Club . They sound like really interesting people.",
			"Yeah!",
			"But now that you're back here does that mean that you're not in the Super Adventure Club anymore?",
			"Nnono!",
			"Ohhh so have you decided you can still belong to the Super Adventure Club but live here in South Park again?",
			"That's right.",
			"Well it seems like the Super Adventure Club was just what you needed . You must be feeling very happy that you found a club to belong to with new friends but that you can also live here in South Park with all your old friends whom you care for deeply.  Right?",
			"That's right. ! ",
			"Well  you're welcome to stay with me until you buy another house.",
			"Thank you. .",
			"Well come on everybody. I'm sure  would like a little time to get moved back in.",
			"That's right! Thank you. Good-bye- Everybody.",
			"TownsfolkLater. Great to have you back. Bye-bye. See ya", 				
			"See you later. Bye-bye",
			"Well I- guess we'll see you in school tomorrow .",
			"You bet! Good-bye. Children! ",
			"Right. Uh see ya.",
			"Uh guys? Did  seem a little uh trippy to you?",
			"Well look. he said he's happier now. Maybe he just needs to rest up a little.",
			"Yeah. I'm sure whatever that Super Adventure Club does is pretty tiring.",
			"Yeah but whatever I'm just glad he's back for good."
		],
		[
			"Hi Mary.",
			"Oh, hi.",
			"How are you doing?",
			"I'm doing alright. How about you?",
			"Not too bad. The weather is great isn't it?",
			"Yes. It's absolutely beautiful today.",
			"I wish it was like this more frequently.",
			"Me too.",
			"So where are you going now?",
			"I'm going to meet a friend of mine at the department store.",
			"Going to do a little shopping?",
			"Yeah, I have to buy some presents for my parents.",
			"What's the occasion?",
			"It's their anniversary.",
			"That's great. Well, you better get going. You don't want to be late.",
			"I'll see you next time.",
			"Sure. Bye."
		],
		[
			"Hi. My name is Josh. It's a pleasure to meet you.",
			"Hi Josh. I'm glad to be here.",
			"Did you have any problems finding this place.",
			"I didn't have any problems. I found directions on the internet so it was pretty easy to find. However, the traffic was not that great.",
			"Traffic is never good around here.",
			"I agree. It would be great if there was a train or a subway line that went through here.",
			"That would be so great. I would definitely take the train if they had it.",
			"Trains are great because you can read a book or get a little rest instead of having to fight the traffic.",
			"Very true. Well, let me begin by telling you about our company..."
		],
		[
			"Hey Paul. What are you doing here?",
			"How's it going? I'm meeting up with a friend here.",
			"How have you been man?",
			"Not too bad. I'm still in school and having a little fun.",
			"How are you enjoying Mr. Lee's history class?",
			"It's so boring.",
			"Tell me about it. If it wasn't a requirement, I wouldn't have taken it.",
			"How about you? What have you been up to?",
			"I finished school last spring. I'm searching for a job now, but I'm slacking off.",
			"I heard the job market is not that hot right now.",
			"I could always take a low end job, but I'm not that desperate yet.",
			"Well, good luck to you.",
			"Thanks. It was good seeing you again.",
			"Yeah. I'll catch you later.",
			"Have a good night."
		],
		[
			"You're John right?",
			"Yes. Oh, you're in my English class right?",
			"Yeah. I'm Martha.",
			"Well it's good to finally meet you.",
			"How are you enjoying the class?",
			"I'm not sure. Some days it seems ok, but other days I am totally bored in class.",
			"I know what you mean. Do you know what is wrong with the weather these days? I haven't seen the sun in 2 weeks.",
			"The weather has been pretty terrible recently.",
			"I'm really hoping the weather gets better.",
			"Do you have something coming up?",
			"To tell you the truth, it's just depressing seeing so much rain.",
			"I don't blame you. It has been pretty gloomy for some time now.",
			"This is my stop. I'll see you later.",
			"I'll see you in class. Bye."
		],
		[

			"Hey John, I'm going to see The Matrix with Peter and Brad. Do you wanna come?",
			"When are you guys going?",
			"We're going to see the eight O'clock showing.",		
			"That would be great. Where are you guys meeting?",
			"We're meeting at the theater at seven thirty.",
			"Great. I'll meet you guys there."
		],
		[
			"Hey Jill.",
			"What's up Mike?",
			"I was wondering if you have any plans for tomorrow night.",
			"Umm... I don't think I have anything special for tomorrow. Why?",
			"Do you want to see The Titanic with me?",
			"I wanted to see that. Yeah. Let's go.",
			"What time is good for you?",
			"How about seven thirty.",
			"Sure. I'll meet you at the theater at seven."
		],
		[
			"I hear Batman is supposed to be good. Do you want to go see it tomorrow?",
			"I have to eat dinner with my family tomorrow.",
			"We can watch the late show. I think it starts at nine forty five.",
			"That would be great.",
			"What time can you be at the theater by?",
			"I can be there by 9:15.",
			"Ok. I'll meet you there."

			"What are you doing tomorrow?",
			"Nothing really.",
			"Let's watch a movie or something.",
			"What's on these days?",
			"I think they're playing Lord of the Rings"
			"That sounds pretty good. Let's watch that.",
			"Where should we meet?",
			"How about at the subway entrance.",
			"Alright. I'll meet you there at one o'clock."
		],
		[

			"Hey Steve, what are you doing these days?",
			"Just working. The same as usual.",
			"Have you seen Shiri?",
			"No. I haven't seen that yet.",
			"Let's go watch it tomorrow. It's a weekend and you should take a break.",
			"Well, to think of it, that sounds great.",
			"I'll give you a call tomorrow about noon and let you know the time.",
			"Ok. I'll see you tomorrow.",
			"See you."
		],
		[

			"What should we do this Saturday?",
			"Rocky six is suppose to come out this Friday.",
			"Yeah, but I don't know if it is going to be any good.",
			"The only reason I want to see it is because I have seen the previous five.",
			"True. Ok. Let's see it this Saturday.",
			"How about we hook up for lunch at 12:00, and then go see the movie afterwards.",
			"Sounds like a plan. Let's meet in front of Tower Records at 12:00."
		],
		[
			"I want to go to the cinema",
			"let me check: https://www.yelp.com/search?find_desc=cinema&find_loc=Hamburg
"
		],
		[
			"I want to see a movie",
			"here are some cinemas: https://www.yelp.com/search?find_desc=cinema&find_loc=Hamburg"			
		],
		[
			"Where are the cinemas ?",
			"here you are: https://www.yelp.com/search?find_desc=cinema&find_loc=Hamburg"
		]
	]
}
